{
    "projects": [
        {
            "name":"BlankFormatProject",
            "link":"yourMothersHouse",
            "tags":["NUNYA"],
            "paragraphs": [
                "IfYouSeeThisThenSomethingIsVeryWrong"
            ],
            "gallery": [
                {
                    "src":"deleteMe",
                    "alt":"deleteMe",
                    "caption":"deleteMe"
                }
            ]

        },

        {
            "name": "Changeling",
            "link": "https://www.changelingvr.com/",
            "tags": ["Internship", "Programming", "Game Design"],
            "paragraphs": [
                "Changeling is a VR narrative puzzle game in which you play as a psychic detective, able to delve into the minds of members of a family, trying to solve the case of what is going on with their baby, all the while playing through psychedelic levels representing their minds. Changeling is the dream project of Elouise Oyzon (or “Weez” as we called her), one of the Game Design and Development teachers at RIT. Over the course of many semesters, she led groups of students as effectively employees to work on the game.",

                "I got to work on it in the summer of 2023 and got to be in the team of people that were the first to work on the toddler’s level of about 8 people (we called ourselves “The Toddler Squad”). It was really interesting and fun getting to prototype the first step in a long line of development for a level, and getting to discuss core mechanics. We settled on the idea of using your imagination to animate toys to complete puzzles. As part of being so early in the development of this level, there was a big focus on documentation for future groups. You can find a copy of a page that I helped write for one of our mechanics linked in one of the windows to the right!",

                "This was by far the largest project I’ve had the privilege of working on so far. We had about 60 total developers working while I was there, split up into numerous different teams; one for each level (Toddler Squad unite), a narrative team, a team focused on optimizing the assets and shaders, an audio team, and many others! I got to help coordinate actions between our team and other teams. We had constant communication with the narrative team since our level structure was still being established, and we found ways of compromising with the Tween’s level team to not overlap mechanics.",

                "The project is made in Unreal Engine 4. We used Perforce primarily for version control and communicated in text channels and calls using discord. In my team, I specialized in making code that could interact with splines and have objects follow set paths at variable speeds and eventually change states. I also helped create a catapult object that would automatically calculate the height and speed to launch an object given a starting and target position using trigonometry."
            ],
            "gallery": [
                {
                    "src": "media/Changeling1.png",
                    "alt": "A screenshot of the Unreal Engine 4 editor",
                    "caption": "Using splines for apples that play Hide & Seek"
                },
                {
                    "src": "media/Changeling2.png",
                    "alt": "An image I drew in paint3D",
                    "caption": "A proposition I drafted to my team of a possible mechanic"
                },
                {
                    "src": "media/Changeling3.png",
                    "alt": "A screenshot of a PDF",
                    "caption": "<a href=\"media/BP_Spoonapult documentation.pdf\"  target=\"_blank\">Click here to see some documentation I helped write</a>"
                }
            ]
        },

        {
            "name": "Bone Hunter",
            "link": "https://bonehunter.framer.website/",
            "tags": ["Programming", "Game Design"],
            "paragraphs": [
                "Bone Hunter is a side-scrolling action platformer set in a dark fantasy universe, inspired by things like Hollow Knight and Dead Cells. Bone Hunter was a very interesting project since it was originally created as a cap-stone project for a number of students in the California College of Art and Design (CCA), and through one of RIT’s professors, Jessica Bayliss, partnered with our class. They planned the levels and made the art assets, while we did the coding.",

                "I worked in a team of 3 other students from RIT and I specialized in coding the boss of the first area, Zed, The Shrine Guardian. I was given a flowchart of different attacks and states that trigger off of eachother and was tasked with creating code that could actually simulate that. This was my first time using Unity’s animation program, so it took a lot of research and iteration, but eventually I was able to get a creature moving and triggering the right attacks (I didn’t have Zed’s animations yet, so I used one of the pre-existing zombie enemies and scaled it up). I coded my own framework for different attacks, each having a different animation trigger and later hitboxes it would spawn corresponding to the animation. One of the hardest parts was making the gameObject’s movement match up to how we wanted the animations to feel, especially the kinds of attacks that launch him into the air, since I also had to make my own movement system in which each attack used a vector2 as a relative target location.",

                "Another challenge I faced with this project was the amount of code that was already written before I joined. Typically with my solo-projects, it's easy to know what everything does and know what to touch and not to touch, but in Bone Hunter, there was pages and pages and pages of documentation and folders and folders of code to sort through. I wasn’t going to be able to read through it all (try as I might), so I had to be strategic about what I’m researching and how much information my brain was able to take in. Through regular communication with my team lead, Sijal Jardat, who was more familiar with the code-base, and digging into relevant documents, I was able to find out what code was already implemented vs what I needed to write.",

                "One of the final constraints on Bone Hunter was communication. Our colleagues were in California, which meant they were 3 hours behind us, so while we were working in-class, they were asleep, and while they were working in-class, we were doing other homework! We had limited time to communicate with them, so we made the best of what we had in our regular weekly meetings, in which we established a clear plan of what they needed from us and what we needed from them, as well as what documents on Confluence to keep an eye on. Any other brief questions were sent over discord, but we tried our best to play around the time delays. Luckily, having a bad college sleep schedule helped out for once since often they were still awake while I was working!"
            ],
            "gallery": [
                {
                    "src": "media/BoneHunter1.gif",
                    "alt": "A gif of a really cool loking enemy working exactly as programmed",
                    "caption": "Zed! (The guy I programmed)"
                },
                {
                    "src": "media/BoneHunter2.png",
                    "alt": "A screenshot of a pdf",
                    "caption": "<a href=\"media/Zed-Documentation.pdf\"  target=\"_blank\">Click here to see the documentation I wrote for Zed</a>"
                }
            ]
        },

        {
            "name": "Boo!",
            "link": "https://narraator0.itch.io/boo",
            "tags":["Programming", "Game Design"],
            "paragraphs": [
                "A \"silly-scary\" game where you run from a ghost on halloween night trying to escape his mansion. Luckily you’re dressed up as a dinosaur and that's terrifying so if you find one of your own candy pieces that's been lost around the mansion, you can turn to the monster and say the titular \"Boo!\" and scare the monster away for a short time, giving what would normally be a simple game about running an extra level of depth and resource management.",

                "I made \"Boo!\" as part of a class project with a team of 4 other talented students. Together we go by \"The Halloweenies\". In this class we practiced team coordination and communication by managing our own sprint tasks, reviewing and improving our own procedures, meeting regularly, and combining our work with github.",

                "On The Halloweenies, I was one of the programmers and I was in charge of the monster’s AI, which used different game states (which are reflected in the monster’s eye light color) and Unity’s navigation system. I was also in charge of coding the logic for the candy objects (picking them up and respawning them after a time), and scaring the monster. You may also recognize the voice of the monster ;)",

                "Some of the problems that we had to troubleshoot in this project were a bug where the monster would move erratically after it was scared and came back. It was because while it was scared, its movement system was changed to being pushed in a direction rather than using Unity’s navigation system, so the monster was being pushed outside of the navmesh. Changing it to use the navigation system even when scared fixed that problem. We also noticed that during our weekly meetings, we weren't working as productively as we wanted. We realized it was because the meetings would just drag on and on so if we didn’t finish our work this minute then it was fine because we could do it later. To fix this, we added a 90 minute limit to our meetings, which forced us to work more productively if we wanted to finish what we wanted done. This also had the nice effect of we had more time at the end of our day that was no longer taken up by meeting times!"
            ],
            "gallery": [
                {
                    "src": "media/Boo!1.png",
                    "alt": "A screenshot of almost being caught",
                    "caption": "Almost being caught!"
                },
                {
                    "src": "media/Boo!2.png",
                    "alt": "A screenshot of scaring the monster",
                    "caption": "Scaring the monster"
                },
                {
                    "src": "media/Boo!3.png",
                    "alt": "A screenshot of the win screen",
                    "caption": "The win screen (which I bet you can't get)"
                }
            ]
        },

        {
            "name":"Flower Creator",
            "link":"https://walsh-teddy.github.io/Flower-Creator/",
            "tags":["Programming", "Game Design", "Web Design"],
            "paragraphs": [
                "The Flower Creator uses something called \"phyllotaxis\" which is an algorithmic way using the golden ratio to simulate how the buds and petals of a flower would grow. I tried messing around with the numbers a bit and found it was quite a fun way to make other interesting patterns. I decided to expand on that idea and make a whole app out of it!",

                "It was made for a class project using Javascript and the canvas drawing API primarily as well as HTML and Bulma CSS for the framework around that. Drawing the flowers was surprisingly easy since the algorithm was already written. The difficult part was reading all the different user inputs and doing the math around them to convert that into an actual flower.",

                "I didn’t just want to make a sandbox app so I also made a game out of it. The challenge mode randomly generates a flower and scores you to see how closely you can match the settings. The maximum score is 500 and my personal high score is 440. It uses local storage to save your personal highscore to your browser.",

                "Some of the issues I ran into during this project that I had to correct were centered around the inherent complexity. Phyllotaxis is not a simple algorithm but I don’t want the user to read a long research paper before messing around, so instead I added simple descriptions in the form of titles (the text that appears when you hover your mouse over an HTML element) of what each setting does. I also received the feedback that challenge mode was way too difficult since there were too many variables, so instead I lowered the amount of settings that the user had to guess down to 1 which was randomly chosen each round.",

                "If I were to revisit this project, I would first touch up the challenge mode. I would add different difficulties which add more and more settings that you have to guess. I also would like to add an online aspect to the app. It would be very interesting for users to be able to save and share different flower creations that they like as well as have a global leaderboard for the challenge mode. To do this, I would use google’s firebase system."
                
            ],
            "gallery": [
                {
                    "src":"media/FlowerCreator1.png",
                    "alt":"A screenshot of the default flower",
                    "caption":"The default flower"
                },
                {
                    "src":"media/FlowerCreator2.png",
                    "alt":"A screenshot of a custom flower",
                    "caption":"A combination I found that draws exactly strait lines"
                }
            ]

        },

        {
            "name":"Raining Cats and Dogs!",
            "link":"https://walsh-teddy.github.io/Raining-Cats-and-Dogs/",
            "tags":["Programming", "Game Design", "Web Design"],
            "paragraphs": [
                "A fun arcade shooter built around a play on words! Shoot down the cats but don’t hit a dog! (Don’t worry, that’s switchable). See how high of a score you can get. My personal record is 70 (and as of writing, that's the world record.)",

                "Built in JavaScript using PixiJS for a class project. I was not working in a team so the game was all created solo. I used the framework of a previous lab assignment we were given called \"circle blast\" that helped me with rendering different scenes and moving objects around (as part of learning Pixi).",

                "This project taught me a lot about Pixi specifically, how to test collisions, how to pivot a shape towards a point (and all the strange math that comes with pointing it in the correct quadrant using tangents), tracking mouse locations and more.",

                "I ran into quite a few issues that I had to troubleshoot. Some were as simple as seeing the error log and realizing that I misspelled a variable name and others were more complex, like making the bullets appear out of the ends of the gun. That required me to go back to previous projects that I did and look online for working code that I could reference. Turns out that PIXI.Graphics objects have a built in X and Y already."
            ],
            "gallery": [
                {
                    "src":"media/RainingCatsAndDogs0.PNG",
                    "alt":"A screenshot of the title screen",
                    "caption":"The title screen"
                },
                {
                    "src":"media/RainingCatsAndDogs1.PNG",
                    "alt":"A screenshot of the gameplay",
                    "caption":"A screenshot of the gameplay"
                }
            ]

        },

        {
            "name":"Magic Flavor Finder",
            "link":"https://walsh-teddy.github.io/Magic-Flavor-Finder/",
            "tags":["Programming", "Web Design"],
            "paragraphs": [
                "I love Magic The Gathering, but not for the typical reasons people like it. Sure, it's a deep level strategy game with great game design that I love, and yes it attracts many collectors, but my main draw to it is its world. I love the setting of Magic The Gathering, all the different strange planes with wild spells, interesting characters, and exciting story that showcases all these different ideas beautifully.",

                "I made this \"Magic Flavor Finder\" to take all the cards of Magic The Gathering and present the flavorful aspects that I love about them, without mechanics, a mostly unique idea from what I can tell.",

                "It uses the Scryfall API. It works by taking different kinds of inputs from the user about the parameters they want (the mana color, the sort order, ect) and custom makes a get request URL to send to the Scryfall server.",

                "The program is pretty straightforward to use. Simply fill in the parameters you want to see and hit the search button! I even included the Scryfall URL that I construct as a little peek behind the curtains.",

                "This project was also done for a class, requiring that we integrate an API into our program. Scryfall was one of the suggested APIs so that's where I started. The project had some interesting challenges, such as learning how to format the Scryfall URL on my own using their public documentation, writing CSS for part of the HTML code that didn’t exist yet because it had to get added in with the JavaScript code I wrote, retrieving information from HTML buttons and other input fields, and saving/retrieving info from local storage."
            ],
            "gallery": [
                {
                    "src":"media/MagicFlavorFinder0.PNG",
                    "alt":"Screenshot of a group of results",
                    "caption":"Finding \"Abzan\" (white, black, and green) cards sorted by rarity"
                },

                {
                    "src":"media/MagicFlavorFinder1.PNG",
                    "alt":"Screenshot of a specific result",
                    "caption":"The result for one of my favorite cards, \"Eerie Ultimatum\""
                }
            ]

        },

        {
            "name":"D&D Spellbook",
            "link":"https://walsh-teddy.github.io/DnD-Spellbook/",
            "tags":["Programming", "Web Design"],
            "paragraphs": [
                "The D&D Spellbook is an app that helps users create and track what spells their Dungeons and Dragons 5th Edition character has. This project I’m particularly satisfied with because several of my friends actually use it regularly to help manage their characters! I have been playing D&D since 2017 and as such I’m intimately familiar with the character creation process, both making my own characters and walking new players through the steps needed. One of the most complex and time consuming steps in my experience is reading through all the spells available and picking from them. I made this app to help newer players understand and keep track of their spell sheet.",

                "I made this as part of a class project for Rich Media Web App Development 1. The main requirement was to use an API to make an app as well as Firebase to store different accounts of data. Me, being the nerd that I am, was immediately drawn to <a href=”https://www.dnd5eapi.co/”>the D&D 5e API</a> (also I already used the Magic The Gathering API). The app takes parameters from the user (spellcasting classes, spell levels, and spell school) and formats a fetch request to the D&D API. Once it gets the response back, it formats all of the spell objects into different spell cards to display on the page!",

                "After that, it uses a combination of local storage and firebase to record each user's actual spell list they’ve constructed. I also added in a similar function (minus the API request) to help the user calculate how many spells and of what level they should take based on their class, level, and spellcasting ability modifier.",

                "Lastly, I used bulma css to make the whole page look clean and programmed web components to implement repeated HTML elements across the different pages (like the navbar, header, and spell cards).",

                "There were a few features that I originally planned on adding, but unfortunately ran out of time before the project due date, which I would add if/when I choose to revisit this project. First, I’m a big D&D Homebrew creator, so it would’ve been really cool to not only be able to add my own custom D&D spells to appear on the app, but also allow other people to create and upload theirs as well! Second, a way to collapse down a spell card if its too long and then manually expand it, so that the formatting is neater. Lastly, I wanted to copy the styles from the actual player handbook to make it feel like you were reading through it and not a separate app."
            ],
            "gallery": [
                {
                    "src":"media/Spellbook1.PNG",
                    "alt":"Screenshot of the home screen",
                    "caption":"The homescreen"
                },
                {
                    "src":"media/Spellbook2.PNG",
                    "alt":"Screenshot of results",
                    "caption":"Every 6th level conjuration druid spell"
                },
                {
                    "src":"media/Spellbook3.PNG",
                    "alt":"Screenshot of search page",
                    "caption":"My 14th level druid getting included above the search parameters"
                }
            ]
        },

        {
            "name":"The Time Capsule",
            "link":"https://www.nexusmods.com/fallout4/mods/76743/",
            "tags":["Game Design", "Creative Writing"],
            "paragraphs": [
                "The Time Capsule is a mod that I made for Fallout 4 in a team of 4 other students (called “Average Clefable”, after the pokemon) for a modding class at RIT over the course of 1 semester. I was the team lead and narrative designer, which means that I was in charge of managing/creating our schedule, keeping people on task, writing the story and dialogue, and levying out tasks. I also ended up being the voice for Giovanni, the central NPC, and implemented voice lines into the game.",

                "The mod’s central concept was originally thought of by Tyler Machanic, one of the other members of my group. It follows Giovanni, a ghoul from pre-war times who has a time-capsule full of memorabilia that's been overrun by mirelurks (a crab-like enemy in Fallout). The time capsule itself is kept preserved by an experimental engine Giovanni created, that can put objects into a stasis, completely stopping the flow of time. As you delve through the time capsule, you start to learn that Giovanni might not be telling you everything he knows… We ended up with 3 possible endings, 2 new NPCs (both voiced), a new sub-area (the time capsule), and a new weapon (The Krono Gun).",

                "As the team lead, one of the challenges that I had to deal with was what to do when we started running behind schedule. We are still human and we made mistakes (for now, we’ll see where that genetic modification project goes…), so there were a few times when we weren't able to get everything done that we had hoped for. Luckily, we expected this to happen and built in some buffer time of weeks towards the end of the schedule that we had for general polish and could re-use as needed. I also checked in with the team member who was falling behind and figured out the cause. Sometimes, work from other classes piled up, other times the task ended up being more complex than expected. In any case, we assessed the situation together and decided whether or not to re-route other people to the task to help. Once our level designer was having trouble detailing everything in time, so we gave some of his later work to a different member so that he would have more time to get details done.",

                "Documentation was a point of focus for us. We created a design document early in the process to make sure we all were working with the same central vision, and we updated that document as the project evolved. We also had weekly presentations for our progress, in which we were tasked with making slides. Not only did they help us communicate our situation to the rest of the class, but they also served a double function of naturally guiding our conversations to the essential topics (what we got done, what we still have to do, and what changed). We also wrote a post-mortem document as one of our final deliverables (which is linked in one of the images to the right!)"
            ],
            "gallery": [
                {
                    "src":"media/TimeCapsule1.png",
                    "alt":"A screenshot in-game from Fallout 4",
                    "caption":"\"The Krono Gun\""
                },

                {
                    "src":"media/TimeCapsule2.png",
                    "alt":"A zoomed in screenshot of a ghoul from Fallout 4",
                    "caption":"My favorite picture of Giovanni"
                },

                {
                    "src":"media/TimeCapsule3.png",
                    "alt":"A screenshot of a pdf we made",
                    "caption":"<a href=\"media/Time-Capsule-Post-Mortem.pdf\"  target=\"_blank\">Click here to check out our post-mortem doc (including our original design doc)</a>"
                }
            ]
        }
    ]
}